src/Enums/SSL_IT_ФорматыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ФорматыДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO_XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XDTO_JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвоичныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поток</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SSL_IT_ВариантыРасположенияМетодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SSL_IT_ВариантыРасположенияМетодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МодульОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодульОбменаИлиПодключаемаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодключаемаяОбработкаИлиМодульОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/SSL_IT_ПодключаемыеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>SSL_IT_ПодключаемыеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расположение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SSL_IT_ВариантыРасположенияОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаМетаданные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбработку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/SSL_IT_УниверсальныйОбмен/Ext/Module.bsl
//rarus+AleksT 21.09.2020 для Мясницкий ряд
// взято из конфигурации Многозадачник и адаптировано.

#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапрос_HTTP(
	Соединение, 
	ИмяМетода,
	ДанныеЗапроса = Неопределено, 
	Знач ФорматЗапроса = Неопределено, 
	Знач ФорматОтвета = Неопределено) Экспорт
	
	SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		ФорматЗапроса, Тип("ПеречислениеСсылка.SSL_IT_ФорматыДанных"), Перечисления.SSL_IT_ФорматыДанных.XDTO_XML);
	SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		ФорматОтвета, Тип("ПеречислениеСсылка.SSL_IT_ФорматыДанных"), Перечисления.SSL_IT_ФорматыДанных.XDTO_XML);
	
	СтруктураСоединения = SSL_IT_УниверсальныйОбменПовтИсп.НайтиСформироватьСтруктуруСоединения(Соединение);	
	HTTPСоединение = СтруктураСоединения.Соединение;
	
	Если HTTPСоединение = Неопределено Тогда 
		// Записать ошибку
	КонецЕсли;	
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрШаблон("%1/hs/UniversalExchange/%2", СтруктураСоединения.ИмяБазы, ИмяМетода));   
	
	УстановитьФорматДанных(HTTPЗапрос, ФорматЗапроса, "RequestFormat");
	УстановитьФорматДанных(HTTPЗапрос, ФорматОтвета, "ResponseFormat");
	SSL_IT_HTTPСервисы.УстановитьТело(HTTPЗапрос, ДанныеЗапроса, ФорматЗапроса);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда 
		ДанныеОтвета = SSL_IT_HTTPСервисы.ПолучитьТело(Ответ, ФорматОтвета);	
	Иначе
		ДанныеОтвета = Неопределено;
		КонтекстноеОписаниеОшибки = СтрШаблон(
		"Описание ошибки: %1
		|Соединение: %2
		|Имя метода: %3
		|Данные: %4", 
		Ответ.ПолучитьТелоКакСтроку(), 
		Строка(Соединение),
		ИмяМетода,
		SSL_IT_ОбработкаДанных.ЗначениеВСтрокуДанных(ДанныеЗапроса));
		
		Если Ответ.КодСостояния = 500 Тогда
			ИмяСобытия = "Ошибка универсального обмена";
		Иначе
			ИмяСобытия = "Неверный код ответа универсального обмена";	
		КонецЕсли;	
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, КонтекстноеОписаниеОшибки);
	КонецЕсли;	
	
	// Возврат	
	Возврат ДанныеОтвета;	
	
КонецФункции	

Функция ОбработатьЗапрос_HTTP(Запрос) Экспорт 
	
	ИмяМетода = Запрос.ПараметрыURL.Получить("MethodName");
	ФорматЗапроса = ПолучитьФорматДанных(Запрос, "RequestFormat");
	ФорматОтвета = ПолучитьФорматДанных(Запрос, "ResponseFormat");
	МетодПоддерживается = Истина;
	Ошибки = Новый Массив();
	
	ДанныеЗапроса = SSL_IT_HTTPСервисы.ПолучитьТело(Запрос, ФорматЗапроса); 
	ДанныеРасположения = SSL_IT_УниверсальныйОбменПовтИсп.ОпределитьРасположениеМетода(ИмяМетода);
	
	Если ДанныеРасположения.Расположение = Перечисления.SSL_IT_ВариантыРасположенияМетодов.МодульОбмена Тогда 
		ДанныеОтвета = SSL_IT_УниверсальныйОбменПереопределяемый.ВыполнитьМетод(ИмяМетода, ДанныеЗапроса, МетодПоддерживается, Ошибки); 
		
	ИначеЕсли ДанныеРасположения.Расположение = Перечисления.SSL_IT_ВариантыРасположенияМетодов.ПодключаемаяОбработка Тогда 
		ДанныеОтвета = ВыполнитьМетодОбработки(ИмяМетода, ДанныеРасположения.КлючОбработки, ДанныеЗапроса, МетодПоддерживается, Ошибки);	
		
	ИначеЕсли ДанныеРасположения.Расположение = Перечисления.SSL_IT_ВариантыРасположенияМетодов.МодульОбменаИлиПодключаемаяОбработка Тогда 
		ДанныеОтвета = SSL_IT_УниверсальныйОбменПереопределяемый.ВыполнитьМетод(ИмяМетода, ДанныеЗапроса, МетодПоддерживается, Ошибки);
		
		Если Не(МетодПоддерживается) Тогда
			МетодПоддерживается = Истина;
			ДанныеОтвета = ВыполнитьМетодОбработки(ИмяМетода, ДанныеРасположения.КлючОбработки, ДанныеЗапроса, МетодПоддерживается, Ошибки);
		КонецЕсли;
		
	ИначеЕсли ДанныеРасположения.Расположение = Перечисления.SSL_IT_ВариантыРасположенияМетодов.ПодключаемаяОбработкаИлиМодульОбмена Тогда 	
		ДанныеОтвета = ВыполнитьМетодОбработки(ИмяМетода, ДанныеРасположения.КлючОбработки, ДанныеЗапроса, МетодПоддерживается, Ошибки);
		
		Если Не(МетодПоддерживается) Тогда
			МетодПоддерживается = Истина;
			ДанныеОтвета = SSL_IT_УниверсальныйОбменПереопределяемый.ВыполнитьМетод(ИмяМетода, ДанныеЗапроса, МетодПоддерживается, Ошибки);
		КонецЕсли;	
		
	ИначеЕсли ДанныеРасположения.Расположение = Перечисления.SSL_IT_ВариантыРасположенияМетодов.Отсутствует Тогда 
		МетодПоддерживается = Ложь;
	КонецЕсли;	
		
	Если Не(МетодПоддерживается) Тогда 
		Ответ = Новый HTTPСервисОтвет(405, СтрШаблон("Метод ""%1"" не поддерживается.", ИмяМетода));
	Иначе
		Ответ = Новый HTTPСервисОтвет(200);	
		SSL_IT_HTTPСервисы.УстановитьТело(Ответ, ДанныеОтвета, ФорматОтвета);
	КонецЕсли;	
	
	// Возврат 
	Возврат Ответ;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьМетодОбработки(ИмяМетода, КлючОбработки, Данные, МетодПоддерживается, Ошибки) Экспорт
	
	Если ПустаяСтрока(КлючОбработки) Тогда 
		ОбъектОбработки = SSL_IT_ПодключаемыеОбработкиСерверСлужебный.НайтиПолучитьОбъектОбработки(
			Справочники.SSL_IT_ПодключаемыеОбработки.SSL_IT_МетодыУниверсальногоОбмена, "Ссылка");
	Иначе
		ОбъектОбработки = SSL_IT_ПодключаемыеОбработкиСерверСлужебный.НайтиПолучитьОбъектОбработки(КлючОбработки, "Ключ");
	КонецЕсли;		
			
	// Возврат
	Если ОбъектОбработки = Неопределено Тогда
		МетодПоддерживается = Ложь;
		Возврат Неопределено;
	Иначе	
		Возврат ОбъектОбработки.ВыполнитьМетод(ИмяМетода, Данные, МетодПоддерживается, Ошибки);
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьФорматДанных(ЗапросОтвет, ИмяЗаголовка)
	
	ИмяФормата = SSL_IT_ОбработкаДанных.ОпределитьЗначение(ЗапросОтвет.Заголовки.Получить(ИмяЗаголовка), Тип("Строка"), "XDTO_XML");
	
	Попытка
		ФорматДанных = Перечисления.SSL_IT_ФорматыДанных[ИмяФормата]; 
	Исключение
		ФорматДанных = Перечисления.SSL_IT_ФорматыДанных.XDTO_XML;	
	КонецПопытки;	
	
	// Возврат
	Возврат ФорматДанных;
		
КонецФункции	

Функция УстановитьФорматДанных(ЗапросОтвет, ФорматДанных, ИмяЗаголовка)
	
	ТаблицаФорматов = SSL_IT_ПолучениеДанных.ПолучитьТаблицуПеречисления("SSL_IT_ФорматыДанных");
	СтрокаФормата = ТаблицаФорматов.Найти(ФорматДанных, "Значение");
	
	Если СтрокаФормата = Неопределено Тогда 
		ЗапросОтвет.Заголовки.Вставить(ИмяЗаголовка, "XDTO_XML");	
	Иначе 
		ЗапросОтвет.Заголовки.Вставить(ИмяЗаголовка, СтрокаФормата.Ключ);	
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти
